idaohang/stm32gps-sleep/Project/stm32gps/main.c
/**
 ******************************************************************************
 * @file    USART/Printf/main.c
 * @author  MCD Application Team
 * @version V3.5.0
 * @date    08-April-2011
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it_api.h"
#include "stm32gps_board.h"
#include "stm32gps_config.h"
#include <stdio.h>
#include <string.h>
#include "usart.h"
#include "GSM_App.h"
#include "GPS_App.h"
#include "eelink.h"
#include "gpio.h"
#include "gps.h"


/* Private typedef -----------------------------------------------------------*/

typedef struct
{
    unsigned char status[2];    // dveice status
    unsigned char analog1[2]; 	// analog input 1
    unsigned char analog2[2];		// analog input 2
} ST_DEVICEDATA, *pST_DEVICEDATA;

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define BKP_DR_NUMBER              42
/* Private variables ---------------------------------------------------------*/
__IO uint32_t LsiFreq = 40000;

// imei information buffer
uint8_t imeiBuf[IMEI_BUF_LEN];
uint8_t g_IMSIBuf[IMSI_INFO_LEN];
uint8_t g_phoneNum[PHONE_NUMBER_LEN];

// packet message
EELINK_SIM_PACKET_LOGIN loginMsg;
char loginBuf[PROTO_LOGIN_BUF];
EELINK_PACKET_GPS gpsMsg;
static char gpsBuf[PROTO_GPS_BUF];

ST_SIMDATA g_simData;
ST_GPSDATA g_gpsData;
ST_DEVICEDATA g_deviceData;
ST_IMSIINFO g_imsiInfo;

ST_BATVOLTAGESTATUS stBATInfo;
ST_CREGINFO stCREGInfo;
ST_IMSIINFO stIMSIInfo;
stru_GPSDATA stGPSData;
uint8_t ucIMEIBuf[IMEI_BUF_LEN];
uint8_t ucSignalQuality;


uint16_t g_sequenceNum;  // GPRS packet's sequence number
uint16_t g_successNum;   // GPRS Send Success number

uint8_t ucGPSStatus;    // GPS status 0x55 - error; 0xaa - ok
uint8_t g_gpsLocationStatus;  // GPS location status 0x55 - error; 0xaa - ok

uint32_t g_setSleepSec;  // Server setting sleep seconds

uint32_t g_alarmFlag;  // 报警标志 SET-valid; RESET-invalid
uint32_t g_alarmPacketFlag; // 报警数据包标志 SET - alarm packet; RESET - not alarm packet


/* Private function prototypes -----------------------------------------------*/
uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen);
void loadLoginMsg(uint8_t *imei, uint16_t sequence);
void PackLoginMsg(void);
void LoadGpsMsg(uint16_t sequence);
void PackGpsMsg(void);
void PackAlarmMsg(void);
void PackFactoryMsg(void);
/* Private functions ---------------------------------------------------------*/

#ifdef DBG_ENABLE_MACRO
void ShowLoginMsg(void)
{
    uint32_t i;
    // imei
    DEBUG("IMEI:");
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        DEBUG("%c-", imeiBuf[i]);
    }
    DEBUG("\r\n");
    // login msg
    DEBUG("LOGIN MSG:");
    for(i = 0; i < PROTO_LOGIN_BUF; i++)
    {
        DEBUG("0x%x-", loginBuf[i]);
    }
    DEBUG("\r\n");
}

void ShowGpsMsg(void)
{
    uint32_t i;
    // gps msg
    DEBUG("GPS MSG:");
    for(i = 0; i < PROTO_GPS_BUF; i++)
    {
        DEBUG("0x%x-", gpsBuf[i]);
    }
    DEBUG("\r\n");
}
#endif // DBG_ENABLE_MACRO

/**
  * @brief  Init Global Variables
  * @param  None
  * @retval None
  */
void InitVariables(void)
{
    uint32_t i;

    g_sequenceNum = 1;
    g_successNum = 0;
    ucGPSStatus = GPS_DEVICE_ERR;
	g_gpsLocationStatus = 0x55;
    g_setSleepSec = SLEEP_NORMAL_SEC;
    g_alarmFlag = RESET;
	g_alarmPacketFlag = RESET;

    memset(imeiBuf, IMEI_BUF_LEN, 0);
    for(i = 0; i < PROTO_LOGIN_BUF; i++)
    {
        loginBuf[i] = 0;
    }
    for(i = 0; i < PROTO_GPS_BUF; i++)
    {
        gpsBuf[i] = 0;
    }

    memset(g_IMSIBuf, IMSI_INFO_LEN, 0);

    for(i = 0; i < PHONE_NUMBER_LEN; i++)
    {
        g_phoneNum[i] = 0x30;
    }

    memset(&loginMsg, sizeof(loginMsg), 0);
    memset(&gpsMsg, sizeof(gpsMsg), 0);

    memset(&g_simData, sizeof(g_simData), 0);
    memset(&g_gpsData, sizeof(g_gpsData), 0);
    memset(&g_deviceData, sizeof(g_deviceData), 0);

}



/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
    int i = 0;
	uint32_t errNum = 0;
    uint8_t gpsRecvTimes = 0;  // GPS Information Received Times
    uint8_t gsmRetyTimes = 0;  // GSM Retry Times
    uint8_t gprsRetyTimes = 0;

	uint8_t gsmRtn = RST_FAIL;
	uint8_t gprsRtn = RST_FAIL;

	
    uint8_t rst = GPS_FAIL;    // GPS function return result
//    ST_GPSRMCINFO rmc;         // GPS RMC packet information
//    unsigned char gprsSendErrNum = 0;  // GPRS send error number
//    uint16_t removeNum = 0;    // Remove detect counter
    uint16_t sendLen = 0;      // GPRS send length (used for GPS and ALARM Msg)
    uint32_t sleepSec = 0;
	uint32_t alarmStickFlag = 0;    // 是否有移开的动作 1- 有 0-无

    // Used for parse GPRS Received Data
    char *pRecvBuf = NULL;     // GPRS Received buffer
    uint32_t recvLen = 0;      // GPRS Received length
    char *pfeed = NULL;        // Used for parse

	uint8_t status = 0;

    /////////////////////////////////////////////////////////////////
    // Configure the GPIO ports and Power OFF GPS and GSM
    /////////////////////////////////////////////////////////////////
    MX_GPIO_Init();
    GPSPowerOff();
    GSM_PowerOff();
    /////////////////////////////////////////////////////////////////
    // Configure the SysTick
    /////////////////////////////////////////////////////////////////
    stm32gps_sys_tick_cfg();

    /////////////////////////////////////////////////////////////////
    // Configure PWR and BKP
    /////////////////////////////////////////////////////////////////
    /* Enable PWR and BKP clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
    /* Enable WKUP pin */
//    PWR_WakeUpPinCmd(ENABLE);


    /////////////////////////////////////////////////////////////////
    // Configure RCC
    /////////////////////////////////////////////////////////////////
    //RCC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure EXTI
    /////////////////////////////////////////////////////////////////
    EXTI_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure RTC
    /////////////////////////////////////////////////////////////////
    RTC_Configuration();
    RTC_NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure TIMER
    /////////////////////////////////////////////////////////////////
    TIM2_Configuration();
    TIM2_NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure LED, BUTTON and USART(GPS + GSM + DEBUG)
    /////////////////////////////////////////////////////////////////

    stm32gps_led_cfg();
    STM_EVAL_LEDOff(LED1);
#ifdef DBG_ENABLE_MACRO
    stm32gps_com_debug_cfg();
#endif // DBG_ENABLE_MACRO

