idaohang/stm32gps-sleep/Project/stm32gps/main.c
    STM_EVAL_PBInit(BUTTON_KEY, BUTTON_MODE_EXTI);

    //usart_init(STM32_SIM908_GPS_COM);
    stm32gps_com_gps_cfg();

    usart_init(STM32_SIM908_GSM_COM);
    stm32gps_com_gsm_cfg();
	/* Enable the EVAL_COM2 Receive interrupt: this interrupt is generated when the 
     EVAL_COM1 receive data register is not empty */
	USART_ITConfig(EVAL_COM2, USART_IT_RXNE, ENABLE);

	USART_NVIC_Configuration();

	/////////////////////////////////////////////////////////////////
    // Turn On TIM2
    /////////////////////////////////////////////////////////////////
    //TIM2_Start();

    /////////////////////////////////////////////////////////////////
    // Init Variables
    /////////////////////////////////////////////////////////////////
    InitVariables();
/*
//GPSPowerOn();
//delay_10ms(200);
//TIM2_Start();

GSM_PowerOn();
delay_10ms(200);
GSM_Init();
GSM_CheckSIMCard();
GSM_CheckNetworkReg();
GSM_CheckGPRSService();
//GSM_SetNetworkReg();
GSM_SetCIPMode(0);
GSM_StartTaskAndSetAPN();
GSM_BringUpConnect();
GSM_GetLocalIP();
while(1)
{
	
	//uint8_t rst = RST_FAIL;
	GSM_ceng();
	
	
	
	//ShowLongitude();
	//ShowLatitude();
	//ShowGPSTime();
	//delay_10ms(500);
	//if(i > 10)
	//{
	//	GPSPowerOff();
	//}
	//i++;
	STM_EVAL_LEDToggle(LED1);
	delay_10ms(500);
}
*/

    /////////////////////////////////////////////////////////////////
    // Main LOOP
    /////////////////////////////////////////////////////////////////
    while(1)
    {
	    delay_10ms(STICK_ON_SEC);

        // If Stick On Car or sth
        if(((uint32_t)Bit_RESET == STM_EVAL_PBGetState(BUTTON_KEY))
                || (SET == g_alarmFlag))
        {
			/////////////////////////////////////////////////////////////////
            // Check Stick Action and set flag
            /////////////////////////////////////////////////////////////////
            if((uint32_t)Bit_SET == STM_EVAL_PBGetState(BUTTON_KEY))
            {
				alarmStickFlag = 1;  // Not Stick
            }
			else
			{
				alarmStickFlag = 0;
			}
            /////////////////////////////////////////////////////////////////
            // First Power ON GPS
            /////////////////////////////////////////////////////////////////
            GPSPowerOn();
			DEBUG("GPSPowerOn\n");
			delay_10ms(200);
			/////////////////////////////////////////////////////////////////
            // Receive GPS Data and Parse, If Recv Success then break
            /////////////////////////////////////////////////////////////////
            while(gpsRecvTimes < GPS_RETERY_TIMES)
			{
				gpsRecvTimes++;
				TIM2_Start();
				rst = GetGPSData();
				TIM2_Stop();
				
				if(RST_OK == rst)
				{
					ucGPSStatus = GPS_DEVICE_OK;
					ParseGPSData(&stGPSData);
					if(1 == stGPSData.status)
					{
						GPSPowerOff();
						DEBUG("GPSData Valid and TurnOFF GPS\r\n");
						break;
					}
				}
				
				/////////////////////////////////////////////////////////////////
                // Set RTC Alarm to wake from STOP mode
                /////////////////////////////////////////////////////////////////
                /* Wait till RTC Second event occurs */
                RTC_ClearFlag(RTC_FLAG_SEC);
                while(RTC_GetFlagStatus(RTC_FLAG_SEC) == RESET);

                /* Alarm in 10 second */
                RTC_SetAlarm(RTC_GetCounter() + GPS_STOPMODE_SEC);
                /* Wait until last write operation on RTC registers has finished */
                RTC_WaitForLastTask();

                /////////////////////////////////////////////////////////////////
                // Go Into STOP Mode
                /////////////////////////////////////////////////////////////////
                /* Request to enter STOP mode with regulator in low power mode*/
                PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

                /* Configures system clock after wake-up from STOP: enable HSE, PLL and select
                	PLL as system clock source (HSE and PLL are disabled in STOP mode) */
                SYSCLKConfig_STOP();
				
				//delay_10ms(500);
			}
			gpsRecvTimes = 0;

            /////////////////////////////////////////////////////////////////
            // Second Power ON GSM
            /////////////////////////////////////////////////////////////////
            GSM_PowerOn();
			delay_10ms(200);

			while(gsmRetyTimes < GSM_RETERY_TIMES)
			{
				gsmRetyTimes++;
				gsmRtn = GSM_Init();
				if(RST_FAIL == gsmRtn)
				{
					continue;
				}
				gsmRtn = GSM_CheckSIMCard();
				if(RST_FAIL == gsmRtn)
				{
					continue;
				}
				gsmRtn = GSM_QuerySignal(&ucSignalQuality);
				if(RST_FAIL == gsmRtn)
				{
					continue;
				}

				gsmRtn = GSM_QueryBatVoltage(&stBATInfo);
				if(RST_FAIL == gsmRtn)
				{
					// clear battery info
				}


				GSM_SetNetworkReg(2);
				if(USART_FAIL == GSM_QueryCreg(&stCREGInfo))
				{
					// clear creg info
				}

				gsmRtn = GSM_QueryImei(ucIMEIBuf);
				if(RST_FAIL == gsmRtn)
				{
					// clear imei buffer
				}

				gsmRtn = GSM_QueryImsi(&stIMSIInfo);
				if(RST_FAIL == gsmRtn)
				{
					// clear imsi info
				}

				gsmRtn = GSM_CheckGPRSService();
				if(RST_FAIL == gsmRtn)
				{
					continue;
				}

				while(gprsRetyTimes < GPRS_RETRY_TIMES)
				{
					gprsRetyTimes++;
					GPRS_CIPShut();
GPRS_CheckLinkStatus(&status);
					gsmRtn = GSM_StartTaskAndSetAPN();
					if(RST_FAIL == gsmRtn)
					{
						continue;
					}
GPRS_CheckLinkStatus(&status);
					gsmRtn = GSM_BringUpConnect();
					if(RST_FAIL == gsmRtn)
					{
						//continue;
					}
GPRS_CheckLinkStatus(&status);
					gsmRtn = GSM_GetLocalIP();
					if(RST_FAIL == gsmRtn)
					{
						//continue;
					}
GPRS_CheckLinkStatus(&status);
					gsmRtn = GSM_StartUpConnect();
					if(RST_FAIL == gsmRtn)
					{
						continue;
					}
GPRS_CheckLinkStatus(&status);
					g_sequenceNum = 1; // Init packet sequence to 1
					errNum = 0;
		            loadLoginMsg(imeiBuf, g_sequenceNum);
		            PackLoginMsg();
ShowLoginMsg();
					while(errNum < 5)
					{
						errNum++;
						gprsRtn = GPRS_SendData_rsp(loginBuf, EELINK_LOGIN_MSGLEN, &pRecvBuf, &recvLen);
						if(USART_SUCESS == gprsRtn)
						{
							// parse response data, pp is 0x70 0x70
			            	pfeed = strstr_len(pRecvBuf, "pp", recvLen);
				            if(pfeed != NULL)
				            {
				                sleepSec = (uint32_t)(((*(pfeed + 7)) << 24)
				                                      + ((*(pfeed + 8)) << 16)
				                                      + ((*(pfeed + 9)) << 8)
				                                      + (*(pfeed + 10)));
								DEBUG("sleepSec = %d\n", sleepSec);
				                // Check sleep time setting value
				                if((sleepSec > SLEEP_TIME_MIN) && (sleepSec < SLEEP_TIME_MAX))
				                {
				                    g_setSleepSec = sleepSec;
									
