idaohang/stm32gps-sleep/Project/stm32gps/main.c
				                }
								DEBUG("g_setSleepSec = %d\n", g_setSleepSec);
				            }
				            else
				            {
				                DEBUG("Server Set Sleep Timer ERROR\n");
				            }
							break;
						}
						else
						{
#ifdef DBG_ENABLE_MACRO
		                STM_EVAL_LEDToggle(LED1);
		                DEBUG("GPRS_SendData LOGIN MSG Fail\n");
#endif // DBG_ENABLE_MACRO
						}
					}

					g_sequenceNum++;
					errNum = 0;

					if((1 == alarmStickFlag)
                        && (SET == g_alarmFlag))
	                {
	                    PackAlarmMsg();
	                    sendLen = EELINK_ALARM_MSGLEN;
						g_alarmPacketFlag = SET;
	                }
	                else
	                {
	                    PackGpsMsg();
	                    sendLen = EELINK_GPS_MSGLEN;
						g_alarmPacketFlag = RESET;
	                }
ShowGpsMsg();
					while(errNum < 5)
					{
						errNum++;
						gprsRtn = GPRS_SendData(gpsBuf, sendLen);
						if(USART_SUCESS == gprsRtn)
						{
							break;
						}
					}

					// break gprs send process
					if(USART_SUCESS == gprsRtn)
					{
						break;
					}
				
				}

			}

 
        }

        /////////////////////////////////////////////////////////////////
        // This Process is Finished, Then goto sleep
        /////////////////////////////////////////////////////////////////

        /////////////////////////////////////////////////////////////////
        // Power OFF GPS and GSM before going into sleep mode
        /////////////////////////////////////////////////////////////////
        STM_EVAL_LEDOff(LED1);
        GPRS_CPOwd();
        GPSPowerOff();
        GSM_PowerOff();
		
        /* Wait till RTC Second event occurs */
        RTC_ClearFlag(RTC_FLAG_SEC);
        while(RTC_GetFlagStatus(RTC_FLAG_SEC) == RESET);

		// NOT Stick and Alarm Flag Valid, Then Sleep Less
		if(((uint32_t)Bit_SET == STM_EVAL_PBGetState(BUTTON_KEY))
                        && (SET == g_alarmFlag))
		{
			RTC_SetAlarm(RTC_GetCounter() + SLEEP_ALARM_SEC);
			DEBUG("alarmmode sleep\n");
		}
		else
		{

        	RTC_SetAlarm(RTC_GetCounter() + g_setSleepSec);
			DEBUG("normalmode sleep %d\n", g_setSleepSec);
		}

        /* Wait until last write operation on RTC registers has finished */
        RTC_WaitForLastTask();
        DEBUG("GOING INTO STOPMODE %d sec\n", g_setSleepSec);
        /* Request to enter STOP mode with regulator in low power mode*/
        PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

        /* Configures system clock after wake-up from STOP: enable HSE, PLL and select
           PLL as system clock source (HSE and PLL are disabled in STOP mode) */
        SYSCLKConfig_STOP();
    }

	// SHOULD NOT GO HAERE
	while(1)
	{
		STM_EVAL_LEDToggle(LED1);
		delay_10ms(50);
	}
}

/*********************************************************************************************************
 ** Function name:       ProcessIMEI()
 ** Descriptions:        将15个字节的IMEI字符串处理成8个字节的EELINK协议格式
 ** input parameters:    pImei 需要处理的15个字节的IMEI字符串
 **                      pRst 返回的字符串指针
 **                      imeilen IMEI字符串的长度
 **                      rstlen 返回的字符串的长度
 ** output parameters:
 ** Returned value:      成功RST_OK 失败RST_FAIL
 *********************************************************************************************************/
uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen)
{
    uint32_t i;
    if(((imeilen / 2 + 1) < rstlen) || (imeilen != 15))
    {
        return RST_FAIL;
    }

    *(pRst + 0) = (*(pImei + 0)) & 0x0F;
    for(i = (imeilen / 2); i > 0 ; i--)
    {
        *(pRst + i) = (((*(pImei + i * 2 - 1)) << 4) & 0xF0) + ((*(pImei + i * 2)) & 0x0F);
    }
    return RST_OK;
}

/**
  * @brief  Load IMEI to loginMsg structure
  * @param  None
  * @retval None
  */
void loadLoginMsg(uint8_t *imei, uint16_t sequence)
{
    loginMsg.hdr.header[0] = PROTO_EELINK_HEADER;
    loginMsg.hdr.header[1] = PROTO_EELINK_HEADER;
    loginMsg.hdr.type = PACKET_EELINK_LOGIN;
    loginMsg.hdr.len[0] = 0x00;
    loginMsg.hdr.len[1] = 0x0C;
    loginMsg.hdr.seq[0] = (uint8_t)((sequence >> 8) & 0x00FF);
    loginMsg.hdr.seq[1] = (uint8_t)((sequence) & 0x00FF);
    if(RST_FAIL == ProcessIMEI(imei, loginMsg.imei, IMEI_BUF_LEN, 8))
    {
        // re-init imei buffer
        memset(loginMsg.imei, sizeof(loginMsg.imei), 0);
        DEBUG("IMEI process ERROR!\n");
    }
    loginMsg.lang = EELINK_LANG; // english
    loginMsg.zone = EELINK_ZONE; // east 8
}

/**
  * @brief  Load loginMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackLoginMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        loginBuf[offset] = loginMsg.hdr.header[i];
        offset++;
    }
    loginBuf[offset] = loginMsg.hdr.type;
    offset++;
    for(i = 0; i < 2; i++)
    {
        loginBuf[offset] = loginMsg.hdr.len[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        loginBuf[offset] = loginMsg.hdr.seq[i];
        offset++;
    }
    for(i = 0; i < 8; i++)
    {
        loginBuf[offset] = loginMsg.imei[i];
        offset++;
    }
    loginBuf[offset] = loginMsg.lang;
    offset++;
    loginBuf[offset] = loginMsg.zone;
    offset++;
    if(offset != (EELINK_LOGIN_MSGLEN))
    {
        DEBUG("PackLoginMsg ERROR!\n");
    }
}

/**
  * @brief  Load GPS information to gpsMsg structure
  * @param  None
  * @retval None
  */
void LoadGpsMsg(uint16_t sequence)
{
    uint32_t i;
    gpsMsg.hdr.header[0] = PROTO_EELINK_HEADER;
    gpsMsg.hdr.header[1] = PROTO_EELINK_HEADER;
    gpsMsg.hdr.type = PACKET_EELINK_GPS;
    gpsMsg.hdr.len[0] = 0x00;
    gpsMsg.hdr.len[1] = (EELINK_GPS_MSGLEN - 5);  // 37
    gpsMsg.hdr.seq[0] = (uint8_t)((sequence >> 8) & 0x00FF);
    gpsMsg.hdr.seq[1] = (uint8_t)((sequence) & 0x00FF);

    for(i = 0; i < 4; i++)
    {
        gpsMsg.utctime[i] = g_gpsData.utc.s[3 - i];
    }

    for(i = 0; i < 4; i++)
    {
        gpsMsg.lati[i] = g_gpsData.latitude.s[3 - i];
    }

    for(i = 0; i < 4; i++)
    {
        gpsMsg.longi[i] = g_gpsData.longitude.s[3 - i];
    }

    gpsMsg.speed = g_gpsData.speed;

