idaohang/stm32gps-sleep/Project/stm32gps/main.c
    for(i = 0; i < 2; i++)
    {
        gpsMsg.course[i] = g_gpsData.course.s[1 - i];
    }

    for(i = 0; i < 9; i++)
    {
        gpsMsg.basestation[i] = g_simData.Station[i];
    }

    gpsMsg.gps_valid = g_gpsData.status;

    for(i = 0; i < 2; i++)
    {
        gpsMsg.dev_status[i] = g_deviceData.status[i];
    }

    for(i = 0; i < 2; i++)
    {
        gpsMsg.battery_voltage[i] = g_simData.Battery[i];
    }

    for(i = 0; i < 2; i++)
    {
        gpsMsg.signal_strength[i] = g_simData.Signal[i];
    }

    for(i = 0; i < 2; i++)
    {
        gpsMsg.analog_input1[i] = g_deviceData.analog1[i];
    }

    for(i = 0; i < 2; i++)
    {
        gpsMsg.analog_input2[i] = g_deviceData.analog2[i];
    }
}

/**
  * @brief  Load gpsMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackGpsMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.header[i];
        offset++;
    }
    gpsBuf[offset] = gpsMsg.hdr.type;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.len[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.seq[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.utc.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.latitude.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.longitude.s[3 - i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.speed;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stGPSData.course.s[1 - i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mcc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mnc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Lac[i];
        offset++;
    }
	gpsBuf[offset] = 0;  // 补零
    offset++;
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Ci[i];
        offset++;
    }
	
    gpsBuf[offset] = stGPSData.status;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stBATInfo.BatVoltage.s[i];
        offset++;
    }

	gpsBuf[offset] = 0;  // 补零
    offset++;
	gpsBuf[offset] = ucSignalQuality;  // 补零
    offset++;
   
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.analog_input1[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.analog_input2[i];
        offset++;
    }

    if(offset != (EELINK_GPS_MSGLEN))
    {
        DEBUG("PackGpsMsg ERROR!\n");
    }
}

/**
  * @brief  Load gpsMsg structure to alarm send buffer
  * @param  None
  * @retval None
  */
void PackAlarmMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.header[i];
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_WARNING; //gpsMsg.hdr.type;
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (EELINK_ALARM_MSGLEN - 5); // header len
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.seq[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.utctime[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.lati[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.longi[i];
        offset++;
    }
    gpsBuf[offset] = gpsMsg.speed;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.course[i];
        offset++;
    }
    for(i = 0; i < 9; i++)
    {
        gpsBuf[offset] = gpsMsg.basestation[i];
        offset++;
    }
    gpsBuf[offset] = gpsMsg.gps_valid;
    offset++;
    gpsBuf[offset] = 0x71;  // remove alarm flag
    offset++;

    if(offset != (EELINK_ALARM_MSGLEN))
    {
        DEBUG("PackAlarmMsg ERROR!\n");
    }
}

/**
  * @brief  Load gpsMsg and loginMsg structure to factory send buffer
  * @param  None
  * @retval None
  */
void PackFactoryMsg(void)
{
    uint32_t i = 0;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_FACTORY_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_FACTORY_REPORT;  // header type
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (FACTORY_REPORT_MSGLEN - 5); // header len
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.hdr.seq[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.utctime[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.lati[i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = gpsMsg.longi[i];
        offset++;
    }
    gpsBuf[offset] = gpsMsg.speed;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.course[i];
        offset++;
    }
    for(i = 0; i < 9; i++)
    {
        gpsBuf[offset] = gpsMsg.basestation[i];
        offset++;
    }
    gpsBuf[offset] = gpsMsg.gps_valid;
    offset++;
    gpsBuf[offset] = 0;  // device status
    offset++;
    gpsBuf[offset] = STM_EVAL_PBGetState(BUTTON_KEY);  // device status
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.battery_voltage[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = gpsMsg.signal_strength[i];
        offset++;
    }
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        gpsBuf[offset] = imeiBuf[i];
        offset++;
    }

    for(i = 0; i < IMSI_INFO_LEN; i++)
    {
        gpsBuf[offset] = g_IMSIBuf[i];
        offset++;
    }
    for(i = 0; i < PHONE_NUMBER_LEN; i++)
    {
        gpsBuf[offset] = g_phoneNum[i];
        offset++;
    }
    gpsBuf[offset] = ucGPSStatus;  // gps status
    offset++;
    gpsBuf[offset] = 0x01;  // software version v1.0
    offset++;
    gpsBuf[offset] = 0x00;
    offset++;

    if(offset != (FACTORY_REPORT_MSGLEN))
    {
        DEBUG("PackFactoryMsg ERROR!\n");
    }
}

/**
 * @}
 */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
